src/tests/performance/artillery.yml

config:
  target: "https://solarspot-backend.onrender.com"

  phases:
    - name:        "Warm-up"
      duration:    30
      arrivalRate: 5

    - name:        "Ramp-up"
      duration:    60
      arrivalRate: 5
      rampTo:      50

    - name:        "Sustained load"
      duration:    120
      arrivalRate: 50

    - name:        "Ramp-down"
      duration:    30
      arrivalRate: 50
      rampTo:      0

  defaults:
    headers:
      Content-Type:  "application/json"
      Accept:        "application/json"

  variables:
    stationId:     "000000000000000000000001"
    loginEmail:    "user@solarspot.dev"
    loginPassword: "User@123456"


scenarios:
  - name:   "List stations — no filters"
    weight: 30
    flow:
      - get:
          url: "/api/stations"
          expect:
            - statusCode: 200

  - name:   "List stations — filtered by connector type"
    weight: 15
    flow:
      - get:
          url: "/api/stations?connectorType=Type-2&sortBy=rating"
          expect:
            - statusCode: 200

  - name:   "List stations — filtered by location radius"
    weight: 15
    flow:
      - get:
          url: "/api/stations?lat=6.9&lng=79.8&radius=25"
          expect:
            - statusCode: 200

  - name:   "Nearby stations — Colombo"
    weight: 10
    flow:
      - get:
          url: "/api/stations/nearby?lat=6.9&lng=79.8&radius=10"
          expect:
            - statusCode: 200

  - name:   "Nearby stations — Kandy"
    weight: 10
    flow:
      - get:
          url: "/api/stations/nearby?lat=7.2906&lng=80.6337&radius=10"
          expect:
            - statusCode: 200

  - name:   "Current weather for station"
    weight: 10
    flow:
      - get:
          url: "/api/weather/station/{{ stationId }}/current"
          expect:
            - statusCode:
                - 200
                - 404

  - name:   "Auth — login"
    weight: 10
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email:    "{{ loginEmail }}"
            password: "{{ loginPassword }}"
          expect:
            - statusCode:
                - 200
                - 401

ensure:
  p95:          500    # ms  — §9.3: p95 latency < 500 ms
  maxErrorRate: 1      # %   — §9.3: error rate < 1 %