src/tests/performance/load.yml

config:
  target: "http://localhost:5000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm-up
    - duration: 120
      arrivalRate: 50
      name: Sustained load
    - duration: 30
      arrivalRate: 100
      name: Peak spike

  defaults:
    headers:
      Content-Type: "application/json"


scenarios:
  - name: "List stations"
    flow:
      - get:
          url: "/api/stations"

  - name: "Get nearby stations"
    flow:
      - get:
          url: "/api/stations/nearby?lat=6.9271&lng=79.8612&radius=5000"

  - name: "Get station weather"
    flow:
      - get:
          url: "/api/stations/{{STATION_ID}}/weather"

  - name: "Solar heatmap"
    flow:
      - get:
          url: "/api/weather/heatmap"

  - name: "Login"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@solarspot.dev"
            password: "Admin@123456"

ensure:
  p95: 200
  maxErrorRate: 1